src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ОбщегоНазначенияСтраж/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает сохраненный пароль из безопасного хранилища для указанного объекта.
//
// Параметры:
//   ОбъектСсылка - СправочникСсылка, ДокументСсылка - ссылка на объект, для которого требуется получить пароль
//
// Возвращаемое значение:
//   Строка - сохраненный пароль или пустая строка, если пароль не найден
Функция ПолучитьПароль(ОбъектСсылка) Экспорт
	СтрПароль = "";
	УстановитьПривилегированныйРежим(Истина);
	ПарольВХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ОбъектСсылка);
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(ПарольВХранилище) Тогда
		СтрПароль = ПарольВХранилище;
	КонецЕсли;
	Возврат СтрПароль;
КонецФункции

// Записывает пароль для указанного объекта в безопасное хранилище.
//
// Параметры:
//   ОбъектСсылка - СправочникСсылка, ДокументСсылка - ссылка на объект, для которого сохраняется пароль
//   Пароль - Строка - пароль для сохранения
Процедура ЗаписатьПароль(ОбъектСсылка, Пароль) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ОбъектСсылка, Пароль);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Обрабатывает изменения пароля в форме перед записью объекта.
//
// Параметры:
//   ОбъектСсылка - СправочникСсылка.ЦентральныеСерверы,
//                  СправочникСсылка.Кластеры,
//                  СправочникСсылка.ИнформационныеБазы,
//                  СправочникСсылка.Аккаунты - ссылка на записываемый объект
//   ПарольИзменен - Булево - признак того, что пароль был изменен на форме (по ссылке)
//   Пароль - Строка - текущее значение пароля на форме (по ссылке)
Процедура ОбработатьПарольФормыПриЗаписи(ОбъектСсылка, ПарольИзменен, Пароль) Экспорт
	Если ПарольИзменен Тогда
		Пароль = СокрЛП(Пароль);
		ЗаписатьПароль(ОбъектСсылка, Пароль);
		Пароль = ?(ЗначениеЗаполнено(Пароль), Новый УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
КонецПроцедуры

// Создаёт (или дополняет) профиль групп доступа «прСтражАдмин2» с ролью СтражБазовая,
// группу доступа «грСтражАдмин2» с этим профилем и пользователя «польСтражАдмин2»
// (аутентификация 1С:Предприятия без задания пароля), включает пользователя в группу доступа.
//
Процедура СоздатьПрофильИГруппуДоступаСтражАдмин2() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаименованиеПрофиля = "прСтражАдмин2";
	НаименованиеГруппы  = "грСтражАдмин2";
	ИмяПользователя     = "польСтражАдмин2";

	ПрофильСсылка = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(НаименованиеПрофиля, Истина);
	Если Не ЗначениеЗаполнено(ПрофильСсылка) Тогда
		ПрофильОбъект = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
		ПрофильОбъект.Наименование = НаименованиеПрофиля;
	Иначе
		ПрофильОбъект = ПрофильСсылка.ПолучитьОбъект();
	КонецЕсли;

	Если ПрофильОбъект.Назначение.Количество() = 0 Тогда
		СтрокаНазначения = ПрофильОбъект.Назначение.Добавить();
		СтрокаНазначения.ТипПользователей = Тип("СправочникСсылка.Пользователи");
	КонецЕсли;

	МетаданныеРоли = Метаданные.Роли.Найти("СтражБазовая");
	Если МетаданныеРоли = Неопределено Тогда
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение НСтр("ru = 'Роль СтражБазовая не найдена в метаданных конфигурации.'");
	КонецЕсли;
	ИдентификаторРоли = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеРоли);
	ОтборРоли = Новый Структура("Роль", ИдентификаторРоли);
	Если ПрофильОбъект.Роли.НайтиСтроки(ОтборРоли).Количество() = 0 Тогда
		ПрофильОбъект.Роли.Добавить().Роль = ИдентификаторРоли;
	КонецЕсли;

	ПрофильОбъект.Записать();
	ПрофильСсылка = ПрофильОбъект.Ссылка;

	ГруппаСсылка = Справочники.ГруппыДоступа.НайтиПоНаименованию(НаименованиеГруппы, Истина);
	Если Не ЗначениеЗаполнено(ГруппаСсылка) Тогда
		ГруппаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
		ГруппаОбъект.Наименование = НаименованиеГруппы;
	Иначе
		ГруппаОбъект = ГруппаСсылка.ПолучитьОбъект();
	КонецЕсли;

	ГруппаОбъект.Профиль = ПрофильСсылка;

	СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(ИмяПользователя);
	Если СвойстваПользователяИБ = Неопределено Тогда

		ОписаниеПользователяИБ = Новый Структура;
		ОписаниеПользователяИБ.Вставить("Имя", ИмяПользователя);
		ОписаниеПользователяИБ.Вставить("ПолноеИмя", ИмяПользователя);
		ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
		ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", Ложь);
		ОписаниеПользователяИБ.Вставить("АутентификацияOpenIDConnect", Ложь);
		ОписаниеПользователяИБ.Вставить("АутентификацияТокеномДоступа", Ложь);
		ОписаниеПользователяИБ.Вставить("АутентификацияОС", Ложь);

		Пользователи.УстановитьСвойстваПользователяИБ(ИмяПользователя, ОписаниеПользователяИБ, Истина, Ложь);
		ИдентификаторПользователяИБ = ОписаниеПользователяИБ.УникальныйИдентификатор;

	Иначе

		ИдентификаторПользователяИБ = СвойстваПользователяИБ.УникальныйИдентификатор;

		ОписаниеПользователяИБ = Новый Структура;
		ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
		ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", Ложь);
		ОписаниеПользователяИБ.Вставить("АутентификацияOpenIDConnect", Ложь);
		ОписаниеПользователяИБ.Вставить("АутентификацияТокеномДоступа", Ложь);
		ОписаниеПользователяИБ.Вставить("АутентификацияОС", Ложь);

		Пользователи.УстановитьСвойстваПользователяИБ(ИмяПользователя, ОписаниеПользователяИБ, Ложь, Ложь);

	КонецЕсли;

	ПользовательСсылка = Пользователи.НайтиПоИдентификатору(ИдентификаторПользователяИБ);
	УстановитьПривилегированныйРежим(Истина);

	Если Не ЗначениеЗаполнено(ПользовательСсылка) Тогда

		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.Наименование = ИмяПользователя;

		ОписаниеДляСправочника = Новый Структура;
		ОписаниеДляСправочника.Вставить("Действие", "Записать");
		ОписаниеДляСправочника.Вставить("УникальныйИдентификатор", ИдентификаторПользователяИБ);

		ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеДляСправочника);
		ПользовательОбъект.Записать();
		ПользовательСсылка = ПользовательОбъект.Ссылка;

	КонецЕсли;

	ОтборУчастника = Новый Структура("Пользователь", ПользовательСсылка);
	Если ГруппаОбъект.Пользователи.НайтиСтроки(ОтборУчастника).Количество() = 0 Тогда
		ГруппаОбъект.Пользователи.Добавить().Пользователь = ПользовательСсылка;
	КонецЕсли;

	ГруппаОбъект.Записать();

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
